#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-02-29T10:56:50.303+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "C44mRFyQVFgHXaWUs1DEaI5bS/WmLukzU3aSVLay45E=" -> (known after apply)
        source_code_size               = 915
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_POST_URL" = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-cost.null_resource.aws_lambda_cost must be replaced
-/+ resource "null_resource" "aws_lambda_cost" {
      ~ id       = "407797187568838472" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_code_hash" = "dNYfg+EOBLEyVNsX9cfAXKpuCYfJCkYVa8Jn9FK8T1g=" -> "gH49/DkEYqNRRB5HLz4Bhm61TFzsVYqB7u1bRDiqaXU="
        }
    }

  # module.aws-lambda-otg.data.archive_file.aws_lambda_otg will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_otg"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-otg/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-otg/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-otg.aws_iam_role_policy.cloudwatch_log will be created
  + resource "aws_iam_role_policy" "cloudwatch_log" {
      + id     = (known after apply)
      + name   = "aws-lambda-otg-cloudwatch-log"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "aws-lambda-otg"
    }

  # module.aws-lambda-otg.aws_lambda_function.aws_lambda_otg will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_otg" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-otg"
        filename                       = "modules/aws-lambda-otg/lambda.zip"
        function_name                  = "aws-lambda-otg"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-otg"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-otg/invocations"
      ~ last_modified                  = "2020-03-01T01:38:54.261+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-otg:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-otg"
        runtime                        = "python3.7"
      ~ source_code_hash               = "tpfEu1OPQeIjWHjwp4DUIEjCoHmuoaVod0qkv+ZD6+I=" -> (known after apply)
        source_code_size               = 615
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "LINE_NOTIFY_TOKEN" = "E5wMLhCmVvsmaYqf8AVezO1O5pySN8cG6LbbaYOUdi8"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-otg.null_resource.aws_lambda_otg must be replaced
-/+ resource "null_resource" "aws_lambda_otg" {
      ~ id       = "5751782350269399009" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_code_hash" = "0hnQkWLbI7T2ckvO6tBA3oa6J2TcDpNl5tos3FXKcXo=" -> "0Y16mRXdoSoopZHTOal+/IK7C1dTBYOKyqfe/xWag8o="
        }
    }

Plan: 3 to add, 2 to change, 2 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
